Conf.Simple/src/Catalogs/SUI_НастройкиМобильныхУстройств/SUI_НастройкиМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиМобильныхУстройств</name>
  <attributes>
    <name>РазмерШрифтаЗаголовкаТаблицы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШрифтаОсновнойИнформации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШрифтаДополнительнойИнформации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШтрифтаОтсутствияВНастройке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналУдачногоСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналПредупреждения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводФакта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфлайнРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфлайнРежимГрупповойРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольGTIN</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьУстаревшиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияДокументовВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьДокументыСоСтатусамиСтрокой</name>
    <comment>Значения разделенные через ;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛоговНаСтранице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияЛоговВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньЛогирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСтекВызовов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфлайнПечать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <comment>&quot;1С&quot; или &quot;ZPL&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколПечати</name>
    <comment>&quot;BT&quot; или &quot;WiFi&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MACАдресBTПринтера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPАдресWiFiПринтера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерИспользованиеКомандИнтентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерIntentScannerMessage</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерIntentScannerVariable</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерIntentScannerLength</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольУникальностиСерий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьСерииБезПредупреждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеПриУдаленииДубля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МассовоеСканированиеВСериях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СимволыРазелители</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПереносСтрокиКакРазделитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяДлинаСимволовШтрихкода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДлинаСимволовШтрихкода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьУстаревшиеЛоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_НастройкиМобильныхУстройств/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура НазначитьОсновнойНастройкой(НастройкаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаСсылка", НастройкаСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	Ссылка <> &НастройкаСсылка
		|	И ОсновнаяНастройка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	Ссылка = &НастройкаСсылка
		|	И ОсновнаяНастройка";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Не РезультатыЗапроса[0].Пустой() Тогда
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.SUI_НастройкиМобильныхУстройств");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[0];
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			Блокировка.Заблокировать();
			
			Выборка = РезультатыЗапроса[0].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НастройкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				НастройкаОбъект.ОсновнаяНастройка = Ложь;
				НастройкаОбъект.ОбменДанными.Загрузка = Истина;
				НастройкаОбъект.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если РезультатыЗапроса[1].Пустой() Тогда
			
			НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
			НастройкаОбъект.ОсновнаяНастройка = Истина;
			НастройкаОбъект.ОбменДанными.Загрузка = Истина;
			НастройкаОбъект.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция СформироватьНастройкиВJSON(НастройкаСсылка) Экспорт
	
	НастройкиВJSON = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаСсылка", НастройкаСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	*
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	Ссылка = &НастройкаСсылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НастройкиПакет = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.mobile-settings.simple", "settings"));
		
		ЗаполнитьОбъектXDTOНастройкиРекурсивно(НастройкиПакет, Выборка, РезультатЗапроса.Колонки);
		
		НастройкиПакет.Проверить();
		
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
		НастройкиПакет.Фабрика().ЗаписатьJSON(ЗаписьJSON, НастройкиПакет, НазначениеТипаXML.Неявное);
		
		НастройкиВJSON = ЗаписьJSON.Закрыть();
		
	КонецЕсли;
	
	Возврат НастройкиВJSON;
		
КонецФункции

Процедура ЗаполнитьОбъектXDTOНастройкиРекурсивно(ОбъектXDTO, Данные, КлючиДанных)
	
	Для Каждого СвойствоОбъектаXDTO Из ОбъектXDTO.Свойства() Цикл
		
		ТипЗначения = ТипЗнч(СвойствоОбъектаXDTO.Тип);
		
		Если ТипЗначения = Тип("ТипОбъектаXDTO") Тогда
			
			ОбъектXDTO[СвойствоОбъектаXDTO.Имя] = ФабрикаXDTO.Создать(СвойствоОбъектаXDTO.Тип);
			ЗаполнитьОбъектXDTOНастройкиРекурсивно(ОбъектXDTO[СвойствоОбъектаXDTO.Имя], Данные, КлючиДанных);
			ОбъектXDTO[СвойствоОбъектаXDTO.Имя].Проверить();
			
		ИначеЕсли ТипЗначения = Тип("ТипЗначенияXDTO") И
			КлючиДанных.Найти(СвойствоОбъектаXDTO.ЛокальноеИмя) <> Неопределено Тогда
			
			ОбъектXDTO[СвойствоОбъектаXDTO.Имя] = Данные[СвойствоОбъектаXDTO.ЛокальноеИмя];
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСписокУдалятьДокументыСоСтатусами(Объект) Экспорт
	
	СписокИзОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		Объект.УдалятьДокументыСоСтатусамиСтрокой, ";", Истина, Истина);
	
	Список = Новый СписокЗначений();
	
	Список.Добавить("to_upload", "К выгрузке");
	Список.Добавить("to_processing", "К выполнению");
	Список.Добавить("uploaded", "Выгружен");
	Список.Добавить("is_completed", "Завершен");
	
	Для Каждого ЭлементСпискаИзОбъекта Из СписокИзОбъекта Цикл
		
		НайденноеЗначение = Список.НайтиПоЗначению(ЭлементСпискаИзОбъекта);
		
		Если НайденноеЗначение <> Неопределено Тогда
			НайденноеЗначение.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
